NewTest/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  xMin     { type symmetryPlane; }
  xMax     { type symmetryPlane; }
  zMin     { type symmetryPlane; }
  zMax     { type symmetryPlane; }

  yMin     { type fixedValue; value uniform (0 0 0); }   // donor glass wall
  yMax     { type fixedValue; value uniform (0 0 0); }   // receiver wall
}


// ************************************************************************* //
