NewTest/constant/laserProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      laserProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Accepted keys for femtosecondLaserModel:
//   peakIntensity       [W/m^2]
//   pulseWidth          [s]
//   wavelength          [m]
//   absorptionCoeff     [1/m]
//   spotSize            [m]
//   pulseEnergy         [J]
//   direction           (vector)
//   focus               (point)
//   scanVelocity        (vector, optional)
//   pulseFrequency      [1/s, optional]
//   pulseDutyCycle      [-, optional]
//   reflectivity        [-]
//   gaussianProfile     [bool]
//   maxReflections      [label]
//   continuousLaser     [bool]
//   laserStartTime      [s]
//   laserEndTime        [s]
//   offFilmScale        [-, optional, default 0.1]
//   offFilmMax          [W/m^3, optional, default 1e14]
// Parameter checks enforce pulseWidth 10fs–10ps, wavelength 100nm–2µm
// and peakIntensity ≤1e16 W/m^2.
// Gaussian pulse focused in the 71.4 nm donor film (y=8.0–8.0714 µm)
// Domain: x∈[0,50e-6], y∈[0,20e-6], z∈[0,10e-6]

// geometry coupling
// Center donor film around laser focus so focus y lies within film bounds
filmYMin        8.0000e-6;
filmYMax        8.0714e-6;   // from setFields metal film
offFilmScale    0.1;       // Intensity scaling outside donor film [-]
offFilmMax      1e14;      // Max volumetric intensity outside film [W/m^3]
// --- Energy & timing ---
// Boosted energy/intensity to reach melt/ablation threshold
pulseEnergy     4.2e-8;          // [J] total energy
pulseWidth      5.0e-13;          // [s] 0.5 ps pulse width
laserStartTime  2.5e-13;        // [s] begin 0.25 ps before pulse center
laserEndTime    7.5e-13;        // [s] end 0.25 ps after, bracketing 0.5 ps pulse

// --- Spatial Gaussian (match the box center and film depth) ---
spotSize        6.8e-6;         // [m] beam diameter

// Put the beam center inside the domain (mid x,z; inside donor film at y≈8.0357 µm)
focus           (25e-6 8.0357e-6 5e-6);
direction       (0 1 0);

// --- Wavelength / interaction ---
wavelength          1.03e-6;  // [m]

// Absorption
absorptionCoeff     5e7;      // [1/m] ~20–50 nm optical depth

// Reflectivity / profile
reflectivity        0.55;
gaussianProfile     true;
maxReflections      1;
transmission    0.445; 	 // through-glass fraction reaching film

// Optional intensity entry (consistent with pulseEnergy & pulseWidth)
peakIntensity       1e15;      // [W/m^2] from pulseEnergy
continuousLaser     false;

// ************************************************************************* //
