NewTest/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Optimized for i7-9750H (6 cores, 12 threads)
numberOfSubdomains  6;

method          simple;

simpleCoeffs
{
    n           (2 3 1);    // 2*3*1 = 6 subdomains
    delta       0.001;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
