NewTest/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "alpha.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;           // Relaxed tolerance
        relTol          0.0;            
        maxIter         100;             
        
        nAlphaCorr      2;              
        nAlphaSubCycles 8;              
        cAlpha          1.5;            // Conservative interface compression
        icAlpha         0;              
        scAlpha         0;
        MULESCorr       true;
        nLimiterIter    3;
        alphaApplyPrevCorr false;
        sharpeningScheme standard;
        thinFilmCoeff   0.0;    
    }
    
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;           // Good enough for millisecond scale
        relTol          0.05;           
        maxIter         100;   
        nPreSweeps      0;
        nPostSweeps     2;         
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     2;
    }
    
    p_rghFinal { $p_rgh; relTol 0; }
    
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;           
        relTol          0.05;            
        maxIter         50;             
    }
    
    UFinal { $U; relTol 0; }
    
    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;           
        relTol          0.1;            
        maxIter         50;     
        minIter         1;
        
    }
    
    Te
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;           // Very relaxed
        relTol          0.1;            
        maxIter         50;        
        minIter         1;             
    }
    
    Tl
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;           
        relTol          0.1;            
        maxIter         50;   
        minIter         1;                  
    }
}

PIMPLE
{
    momentumPredictor           true;   
    nOuterCorrectors            2;      // Reduced - don't need so many
    nCorrectors                 3;      
    nNonOrthogonalCorrectors    3;      
    
    outerCorrectorResidualControl
    {
        p_rgh   { tolerance 1e-5; relTol 0; }
        U       { tolerance 1e-5; relTol 0; }
    }
    
    p_rghRefCell                0;
    p_rghRefValue               100000;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.2;            
        "alpha.*"       0.5;            
    }
    equations
    {
        U               0.5;            // More aggressive - stable at this scale
        UFinal          1.0;            
        T               0.5;            
        Te              0.5;            // Still conservative for electron temp
        Tl              0.5;            
        
        ".*Final"       1.0;            
    }
}
relaxP      0.3;   // pEqn.H reads from mesh.solutionDict()
targetResP  0.1;   // pEqn.H reads from mesh.solutionDict()
compInterFoamCoeffs
{
    maxReasonableVelocity  250;     // UEqn.H
    defaultMetalDensity    4500;    // UEqn.H (fallback if rho1 invalid)
    defaultAirDensity      1.2;     // UEqn.H (fallback if rho2 invalid)
    maxVelocity            300;    // UEqn.H velocity limiter
    // Keep α bounded but not over-restricted
    enableAlphaClamp  true;
    minAlpha          0.0;
    maxAlpha          1.0;
    pressureClamp   true;
    maxPressure   1e8;     // 100 MPa is plenty and cuts clamp spread
    minPressure   1e3;     // keep a modest floor
    // Momentum matrix safety (also read from controlDict as fallback)
    enableRAUClamp    true;
    minRAU            1e-12;
    maxRAU            1e4;
	minRAUf            1e-12;
	maxRAUf            1e4;

    // Optional residual targeting used in your code
    targetResU        0.05;
}

