NewTest/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  // Focus/jet region (meters)
  { name focusBox; type cellSet; action new; source boxToCell;
    sourceInfo { box (1.7e-5 7.95e-6 0) (3.3e-5 2.00e-5 1.0e-5); } }

  // Substrate only below the Ti film: y ∈ [0, 8.0000 µm]
  { name substrateSet; type cellSet; action new; source boxToCell;
    sourceInfo { box (0 0 0) (5.0e-5 8.0000e-6 1.0e-5); } }
  { name substrate; type cellZoneSet; action new; source setToCellZone;
    sourceInfo { set substrateSet; } }
);
// ************************************************************************* //
